Revit 2027 API
FamilyManager.MakeReporting Method
Set the family parameter as a reporting parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void MakeReporting(
	FamilyParameter familyParameter
)
Public Sub MakeReporting (
	familyParameter As FamilyParameter
)
public:
void MakeReporting(
	FamilyParameter^ familyParameter
)
member MakeReporting :
        familyParameter : FamilyParameter -> unit
Parameters
familyParameter FamilyParameter
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input argument-"familyParameter"-is null.
InvalidOperationException |  Thrown when the parameter can not be changed to a reporting parameter.
See Also
Reference
FamilyManager Class
Autodesk.Revit.DB Namespace